В классическом подходе обладает локациями и пешками. Ну ил они имеют фракцию, как значение переменной фракции.

Вопрос зависящий от уровня моддели - может ли фракция управляться как это делает игрок. Приоритеты работ, эффективность постройк, разные тактики сражения и развития. При подобном усложнении механики может появиться разница между результатами уаправления фракции ИИ, и  ожидаемым результатом от статистического метода, из за чего переход между версияями будет сильно влиять на балланс сил.

Насколько понятие фракции вообще применимо в децентрализованном планировщике (капитализме)?